posts/algorithm/algorithm-weekly-four-sum/index.org
#+BEGIN_COMMENT
.. title: 每周算法：四数之和
.. slug: algorithm-weekly-four-sum
.. date: 2018-09-21 09:56:09 UTC+08:00
.. tags: algorithm, leetcode
.. category: algorithm
.. link: https://leetcode.com/problems/4sum/description/
.. description:
.. type: text
#+END_COMMENT

#+TITLE: 每周算法：四数之和

** Description
Given an array =nums= of n integers and an integer =target= , are there elements /a/, /b/, /c/, and /d/ in =nums= such that /a/ + /b/ + /c/ + /d/ = =target= ? Find all unique quadruplets in the array which gives the sum of =target= .

*Note:*
The solution set must not contain duplicate quadruplets.

*Example:*
#+BEGIN_EXAMPLE
Given array nums = [1, 0, -1, 0, -2, 2], and target = 0.

A solution set is:
[
  [-1,  0, 0, 1],
  [-2, -1, 1, 2],
  [-2,  0, 0, 2]
]
#+END_EXAMPLE

** Solution

*** Apporach 1 暴力解法
将所有的组合穷举出来，与目标进行逐一比对，将满足条件的组合收集起来，就能得到结果。需要注意的是去除结果中的重复项。
#+BEGIN_SRC cpp
vector<vector<int>> fourSum(vector<int>& nums, int target) {
    set<vector<int>> ans;
    for (size_t i = 0; i < nums.size(); ++i) {
        for (size_t j=i+1; j < nums.size(); ++j) {
            for (size_t k=j+1; k < nums.size(); ++k) {
                for (size_t m=k+1; m < nums.size(); ++m) {
                    if (nums[i] + nums[j] + nums[k] + nums[m] == target) {
                        vector<int> t({nums[i], nums[j], nums[k], nums[m]});
                        sort(t.begin(), t.end());
                        ans.insert(t);
                    }
                }
            }
        }
    }
    return vector<vector<int>>(ans.begin(), ans.end());
}
#+END_SRC

