posts/algorithm/algorithm-weekly-four-sum/index.org
*** Approach 2 拓展3sum算法
这道题的与之前的 [[post-url://algorithm-weekly-three-sum/][3 sum]] 十分类似，通过简单的拓展就能得到该问题的解法。
#+BEGIN_SRC cpp
vector<vector<int>> fourSum(vector<int>& nums, int target) {
    vector<vector<int>> ans;
    std::sort(nums.begin(), nums.end());
    for (size_t i = 0; i < nums.size();) {
        int n1 = nums[i];
        int target_1 = target - n1;
        for (size_t j=i+1; j<nums.size();) {
            int n2 = nums[j];
            int target_2 = target_1 - n2;

            int front = j+1;
            int end = nums.size() - 1;
            while (front < end) {
                int n3 = nums[front];
                int sum = n3 + nums[end];
                if (sum == target_2) {
                    ans.push_back(vector<int> ({n1, n2, n3, nums[end]}));
                    do { ++front; } while(front < end && nums[front] == n3);
                }
                else if (sum > target_2) {
                    --end;
                }
                else {
                    ++front;
                }
            }
            do { ++j; } while (j<nums.size() && nums[j] == n2);
        }
        do { ++i; } while (i < nums.size() && nums[i] == n1);
    }
    return ans;
}
#+END_SRC

